In [11]:
# initial imports
import pandas as pd
from path import Path

In [12]:
# Load data
file_path = Path("../Resources/loans_data.csv")
loans_df = pd.read_csv(file_path)
loans_df.head()
#loans_df.sample(n=20)

   amount  term      month  age             education  gender  bad
0    1000    30       June   45  High School or Below    male    0
1    1000    30       July   50              Bachelor  female    0
2    1000    30     August   33              Bachelor  female    0
3    1000    15  September   27               college    male    0
4    1000    30    October   28               college  female    0

In [13]:
# Months dictionary
months_num = {
    "January": 1,
    "February": 2,
    "March": 3,
    "April": 4,
    "May": 5,
    "June": 6,
    "July": 7,
    "August": 8,
    "September": 9,
    "October": 10,
    "November": 11,
    "December": 12,
}

In [14]:
#transform the text columns to numerical
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
#transform the gender column
loans_df["gender"] = le.fit_transform(loans_df["gender"])
#transform the education column
loans_df["education"] = le.fit_transform(loans_df["education"])
#transform the month column using data dictionary: months_num
loans_df["month_num"] = loans_df["month"].apply(lambda x: months_num[x])
loans_df = loans_df.drop(["month"], axis=1)

In [16]:
loans_df.sample(n=10)

     amount  term  age  education  gender  bad  month_num
142    1000     7   27          1       1    0          1
157     800    15   29          1       1    0         12
139    1000    30   20          1       1    0          3
472     800    15   33          3       1    1         10
478    1000    15   22          1       1    1          3
146    1000    30   26          3       0    0         10
111    1000    30   27          3       0    0          1
162    1000    30   28          1       1    0          4
11     1000    15   39          1       1    0          9
270    1000    30   29          1       1    0          1

# OR THIS OPTION

In [23]:
alt_df = loans_df = pd.read_csv(file_path)
# using pandas to encode gender and education
alt_df = pd.get_dummies(alt_df, columns= ["education", "gender"])
alt_df["month"] = alt_df["month"].apply(lambda x: months_num[x])
#alt_df.drop(["month"])
alt_df.head()

,amount,term,month,age,bad,education_Bachelor,education_High School or Below,education_Master or Above,education_college,gender_female,gender_male
0,1000,30,6,45,0,0,1,0,0,0,1
1,1000,30,7,50,0,1,0,0,0,1,0
2,1000,30,8,33,0,1,0,0,0,1,0
3,1000,15,9,27,0,0,0,0,1,0,1
4,1000,30,10,28,0,0,0,0,1,1,0